---
title: Pandas groupby
author: Tom
date: "2023-12-23"
toc: true  # 是否开启文章目录
toc-expand: true
code-block-bg: true  # 代码块背景颜色
highlight-style: atom-one  # 代码块语法高亮风格
categories:
  - 数据分析
code-fold: false  # 代码块是否折叠
cold-line-numbers: true # 代码块是否显示行数
code-copy: true # true/false/hover
draft: true  # 博文是否为草稿，草稿不显示在博客中
html-math-method: katex # latex 引擎，默认是 MathJax
jupyter: python3
---

In [24]:
import pandas as pd
import numpy as np

In [25]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [26]:
df

     A      B         C         D
0  foo    one  0.838412 -0.439652
1  bar    one  1.126029  0.393209
2  foo    two  0.700141  1.028406
3  bar  three -0.688331  0.182502
4  foo    two  0.734111 -0.424058
5  bar    two  0.593810 -1.090461
6  foo    one -0.003417 -0.123665
7  foo  three  1.529226  0.209219

In [46]:
list(df.groupby("A"))

[('bar',
       A      B         C         D
  1  bar    one  1.126029  0.393209
  3  bar  three -0.688331  0.182502
  5  bar    two  0.593810 -1.090461),
 ('foo',
       A      B         C         D
  0  foo    one  0.838412 -0.439652
  2  foo    two  0.700141  1.028406
  4  foo    two  0.734111 -0.424058
  6  foo    one -0.003417 -0.123665
  7  foo  three  1.529226  0.209219)]

In [47]:
df.groupby("A").first()

       B         C         D
A
bar  one  1.126029  0.393209
foo  one  0.838412 -0.439652

In [49]:
df.groupby("A").last()

         B         C         D
A
bar    two  0.593810 -1.090461
foo  three  1.529226  0.209219

In [32]:
df.groupby(["A", "B"]).agg("mean")

                  C         D
A   B
bar one    1.126029  0.393209
    three -0.688331  0.182502
    two    0.593810 -1.090461
foo one    0.417497 -0.281659
    three  1.529226  0.209219
    two    0.717126  0.302174

In [38]:
df.groupby(["A", "B"], group_keys=True).apply(lambda x: x * x)

                    C         D
A   B
bar one   1  1.267942  0.154613
    three 3  0.473799  0.033307
    two   5  0.352611  1.189104
foo one   0  0.702935  0.193294
          6  0.000012  0.015293
    three 7  2.338531  0.043772
    two   2  0.490198  1.057620
          4  0.538919  0.179825

In [39]:
df2 = df.set_index(["A", "B"])
df2

                  C         D
A   B
foo one    0.838412 -0.439652
bar one    1.126029  0.393209
foo two    0.700141  1.028406
bar three -0.688331  0.182502
foo two    0.734111 -0.424058
bar two    0.593810 -1.090461
foo one   -0.003417 -0.123665
    three  1.529226  0.209219

In [42]:
df2.index.names.difference(["B"])

FrozenList(['A'])

In [43]:
grouped = df2.groupby(level="A")

In [44]:
grouped.sum()

            C        D
A
bar  1.031509 -0.51475
foo  3.798473  0.25025